apache/nuttx/arch/renesas/src/rx65n/rx65n_dtc.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_dtc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>

#include "renesas_internal.h"
#include "chip.h"
#include "rx65n_definitions.h"
#include "rx65n_dtc.h"

#include <arch/board/board.h>
#include <arch/board/rx65n_gpio.h>

#if defined(CONFIG_RX65N_DTC)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* DTC IP version */

#define DTC_IP_VER_DTC      (0)
#define DTC_IP_VER_DTCa     (1)
#define DTC_IP_VER_DTCb     (2)

/* Supported DTC IP version and channel number */

#if defined(CONFIG_ARCH_BOARD_RX65N_RSK2MB) || defined(CONFIG_ARCH_BOARD_RX65N_GRROSE)
#define DTC_IP_VER DTC_IP_VER_DTCb
#define DTC_NCHANNELS     (1)
#define DTC_CHANNEL_ID    (0)
#endif

/* Total number of interrupt source that can start DTC */

#if defined(CONFIG_ARCH_BOARD_RX65N_RSK2MB)
#define DTC_NUM_INTERRUPT_SRC  (201)
#else
#define DTC_NUM_INTERRUPT_SRC  (199)
#endif

/* DTC supports same number as all interrupt sources that can start
 * the DTC transfer
 */

#define  DTC_TRANSFER_NCHANNELS DTC_NUM_INTERRUPT_SRC

/* Vector number related macro */

#define DTC_VECTOR_NUMBER (256) /* Hexa Decimal value is ox100 */
#define DTC_EACH_VECTOR_SIZE (4)
#define DTC_VECTOR_TABLE_SIZE ((DTC_VECTOR_NUMBER) * (DTC_EACH_VECTOR_SIZE))
#define DTC_INDEX_TABLE_SIZE ((DTC_VECTOR_NUMBER) * (DTC_EACH_VECTOR_SIZE))
#define DTC_VECTOR_ADDRESS_ALIGN (0x400) /* lower 10 bits of the base address */
#define DTC_VECTOR_ADDRESS_MASK 0xfffffc00
#define DTC_MAX_VECT_NUMBER DTCE_PERIA_INTA255
#define DTC_MIN_VECT_NUMBER DTCE_ICU_SWINT2

#define DTC_INVALID_CMND      ((uint32_t)(0x00000001))

#if defined (CONFIG_RX65N_DTC_SEQUENCE_TRANSFER_MODE)

/* Size of DTC Vector table and DTC Index table (in byte units) */

#define DTC_VECTOR_TABLE_SIZE_BYTES (DTC_VECTOR_ADDRESS_ALIGN + DTC_VECTOR_TABLE_SIZE + DTC_INDEX_TABLE_SIZE)

#else

/* Size of DTC Vector table (in byte units) */

#define DTC_VECTOR_TABLE_SIZE_BYTES (DTC_VECTOR_ADDRESS_ALIGN + DTC_VECTOR_TABLE_SIZE)

#endif

/* DTC register mask and value */

#define    DTC_ACT_BIT_MASK            (0x8000) /* DTC Active flag (DTCSTS.ACT) bit mask */
#define    DTC_VECT_NR_MASK            (0x00FF) /* DTC-Activating Vector Number bits mask */
#define    DTC_MAX_16BITS_COUNT_VAL    (65536)  /* The maximum value of 16bit count value */
#define    DTC_MAX_8BITS_COUNT_VAL     (256)    /* The maximum value of 8bit count value */
#define    DTC_MIN_COUNT_VAL           (1)      /* The minimum of count value  and block size */
#define    DTC_ESPSEL_BIT_MASK         (0x8000) /* DTC Sequence transfer vector number setting bit mask */

/****************************************************************************
 * Typedef definitions
 ****************************************************************************/

/* The DTC Mode Internal Register A (MRA) structure */

struct st_dtc_mra_bit
{
#if (DTC_IP_VER == DTC_IP_VER_DTCa)
#ifdef __RX_LITTLE_ENDIAN__
  uint8_t rs:2; /* reserved */
  uint8_t SM:2; /* Transfer Source Address Addressing Mode */
  uint8_t SZ:2; /* DTC Data Transfer Size */
  uint8_t MD:2; /* b7,b6: DTC Transfer Mode Select */
#else
  uint8_t MD:2; /* b7,b6: DTC Transfer Mode Select */
  uint8_t SZ:2; /* DTC Data Transfer Size */
  uint8_t SM:2; /* Transfer Source Address Addressing Mode */
  uint8_t rs:2; /* reserved */
#endif
#else /* (DTC_IP_VER == DTC_IP_VER_DTCb) */
#ifdef __RX_LITTLE_ENDIAN__
  uint8_t WBDIS:1; /* Write-back Disable */
  uint8_t rs:1;    /* reserved */
  uint8_t SM:2;    /* Transfer Source Address Addressing Mode */
  uint8_t SZ:2;    /* DTC Data Transfer Size */
  uint8_t MD:2;    /* b7,b6: DTC Transfer Mode Select */
#else
  uint8_t MD:2;    /* b7,b6: DTC Transfer Mode Select */
  uint8_t SZ:2;    /* DTC Data Transfer Size */
  uint8_t SM:2;    /* Transfer Source Address Addressing Mode */
  uint8_t rs:1;    /* reserved */
  uint8_t WBDIS:1; /* Write-back Disable */
#endif
#endif
};

typedef union dtc_mra
{
  uint8_t BYTE;
  struct st_dtc_mra_bit BIT;
} dtc_mra_t;

/* The DTC Mode Internal Register B (MRB) structure */

struct st_dtc_mrb_bit
{
#if (DTC_IP_VER == DTC_IP_VER_DTCa)
#ifdef __RX_LITTLE_ENDIAN__
  uint8_t rs:2;    /* reserved */
  uint8_t DM  :2;  /* Transfer Destination Address Addressing Mode */
  uint8_t DTS  :1; /* DTC Transfer Mode Select */
  uint8_t DISEL:1; /* DTC Interrupt Select */
  uint8_t CHNS :1; /* DTC Chain Transfer Select */
  uint8_t CHNE :1; /* b7: DTC Chain Transfer Enable */
#else
  uint8_t CHNE :1; /* b7: DTC Chain Transfer Enable */
  uint8_t CHNS :1; /* DTC Chain Transfer Select */
  uint8_t DISEL:1; /* DTC Interrupt Select */
  uint8_t DTS  :1; /* DTC Transfer Mode Select */
  uint8_t DM   :2; /* Transfer Destination Address Addressing Mode */
  uint8_t rs   :2; /* reserved */
#endif
#else /* (DTC_IP_VER == DTC_IP_VER_DTCb) */
#ifdef __RX_LITTLE_ENDIAN__
  uint8_t SQEND:1;  /* Sequence Transfer End */
  uint8_t INDEX:1;  /* Index Table Reference */
  uint8_t DM   :2;  /* Transfer Destination Address Addressing Mode */
  uint8_t DTS  :1;  /* DTC Transfer Mode Select */
  uint8_t DISEL:1;  /* DTC Interrupt Select */
  uint8_t CHNS :1;  /* DTC Chain Transfer Select */
  uint8_t CHNE :1;  /* b7: DTC Chain Transfer Enable */
#else
  uint8_t CHNE :1;  /* b7: DTC Chain Transfer Enable */
  uint8_t CHNS :1;  /* DTC Chain Transfer Select */
  uint8_t DISEL:1;  /* DTC Interrupt Select */
  uint8_t DTS  :1;  /* DTC Transfer Mode Select */
  uint8_t DM   :2;  /* Transfer Destination Address Addressing Mode */
  uint8_t INDEX:1;  /* Index Table Reference */
  uint8_t SQEND:1;  /* Sequence Transfer End */
#endif
#endif
};

typedef union dtc_mrb
{
  uint8_t BYTE;
  struct st_dtc_mrb_bit BIT;
} dtc_mrb_t;

#if (DTC_IP_VER == DTC_IP_VER_DTCb)
struct st_dtc_mrc_bit
{
#ifdef __RX_LITTLE_ENDIAN__
  uint8_t DISPE :1;
  uint8_t rs :7;    /* reserved */
#else
  uint8_t rs :7;    /* reserved */
  uint8_t DISPE :1;
#endif
};

typedef union dtc_mrc
{
  uint8_t BYTE;
  struct st_dtc_mrc_bit BIT;
} dtc_mrc_t;

#endif /* (DTC_IP_VER == DTC_IP_VER_DTCb) */

/* The DTC Transfer Count Register A (CRA) structure */

