apache/nuttx/arch/renesas/src/rx65n/rx65n_dtc.c
struct st_dtc_cra_byte
{
#ifdef __RX_LITTLE_ENDIAN__
  uint8_t CRA_L;
  uint8_t CRA_H;
#else
  uint8_t CRA_H;
  uint8_t CRA_L;
#endif
};

typedef union dtc_cra
{
  uint16_t WORD;
  struct st_dtc_cra_byte BYTE;
} dtc_cra_t;

/* The DTC Transfer Count Register B (CRB) structure */

typedef union dtc_crb
{
  uint16_t WORD;
} dtc_crb_t;

#if defined(CONFIG_RX65N_DTC_SHORT_ADDRESS_MODE) /* Transfer data in short-address mode */

struct st_first_word
  {
#ifdef __RX_LITTLE_ENDIAN__
    uint8_t SAR[3];
    dtc_mra_t MRA;
#else
    dtc_mra_t MRA;
    uint8_t SAR[3];
#endif
  };

struct st_second_word
  {
#ifdef __RX_LITTLE_ENDIAN__
    uint8_t SAR[3];
    dtc_mrb_t MRB;
#else
    dtc_mrb_t MRB;
    uint8_t DAR[3];
#endif
  };

struct st_third_word
  {
#ifdef __RX_LITTLE_ENDIAN__
    dtc_crb_t CRB;
    dtc_cra_t CRA;
#else
    dtc_cra_t CRA;
    dtc_crb_t CRB;
#endif
  };

typedef union lword1
  {
    uint32_t LWORD;
    struct st_first_word REG;
  } lword1_t;

typedef union lword2
  {
    uint32_t LWORD;
    struct st_second_word REG;
  } lword2_t;

typedef union lword3
  {
    uint32_t LWORD;
    struct st_third_word REG;
  } lword3_t;

typedef struct st_dtc_short_transfer_data
  {
    lword1_t FIRST_LWORD;
    lword2_t SECOND_LWORD;
    lword3_t THIRD_LWORD;
  } st_dtc_internal_registers_t;

#else /* Transfer data in full-address mode */
struct st_first_lword
  {
#ifdef __RX_LITTLE_ENDIAN__
#if (DTC_IP_VER == DTC_IP_VER_DTCa)
  uint16_t reserver; /* reserve area */
#else
  uint8_t reserver; /* reserve area */
  dtc_mrc_t MRC;
#endif
  dtc_mrb_t MRB;
  dtc_mra_t MRA;
#else
  dtc_mra_t MRA;
  dtc_mrb_t MRB;
#if (DTC_IP_VER == DTC_IP_VER_DTCa)
  uint16_t reserver; /* reserve area */
#else
  dtc_mrc_t MRC;
  uint8_t reserver; /* reserve area */
#endif

#endif
  };

struct st_fourth_lword
  {
#ifdef __RX_LITTLE_ENDIAN__
    dtc_crb_t CRB;
    dtc_cra_t CRA;
#else
    dtc_cra_t CRA;
    dtc_crb_t CRB;
#endif
  };

typedef union lword1
  {
    uint32_t LWORD;
    struct st_first_lword REG;
  } lword1_t;

typedef union lword2
  {
    uint32_t SAR;
  }lword2_t;

typedef union lword3
  {
    uint32_t DAR;
  } lword3_t;

typedef union lword4
  {
    uint32_t LWORD;
    struct st_fourth_lword REG;
  } lword4_t;

typedef struct st_dtc_full_transfer_data
  {
    lword1_t FIRST_LWORD;
    lword2_t SECOND_LWORD;
    lword3_t THIRD_LWORD;
    lword4_t FOURTH_LWORD;
  } st_dtc_internal_registers_t;

#endif /* DTC_CFG_SHORT_ADDRESS_MODE */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes one dtc channel */

struct rx65n_dtc_s
{
  uint8_t chan;           /* DTC channel number */
  bool initialized;       /* Initialization status */

  uint32_t base;          /* DTC channel register base address */

  uint8_t * vectortable; /* Vector table pointer */
#if defined (CONFIG_RX65N_DTC_SEQUENCE_TRANSFER_MODE)
  uint8_t * indextable;  /* Index table pointer for sequence transfer */
#endif

  uint8_t addmode;        /* Address mode */

#if defined(CONFIG_RX65N_DTC_TRANSFER_DATA_READ_SKIP)
  uint8_t readskip;       /* Read skip enable or disable */
#endif
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Statically allocated vector table */

uint8_t vectortable[DTC_VECTOR_TABLE_SIZE_BYTES];

/* This array describes the state of each dtc: Only one channel */

static struct rx65n_dtc_s g_dtchandle[DTC_NCHANNELS] =
{
  {
    .chan  = DTC_CHANNEL_ID,
    .base  = RX65N_DTC_BASE,
    .vectortable = vectortable,
  },
};

/* The array of all interrupt source */

const dtc_activation_source_t g_dtcsource[DTC_NUM_INTERRUPT_SRC] =
{
  DTCE_ICU_SWINT2, DTCE_ICU_SWINT,
  DTCE_CMT0_CMI0,
  DTCE_CMT1_CMI1,
  DTCE_CMTW0_CMWI0,
  DTCE_CMTW1_CMWI1,
  DTCE_USB0_D0FIFO0, DTCE_USB0_D1FIFO0,
  DTCE_RSPI0_SPRI0, DTCE_RSPI0_SPTI0,
  DTCE_RSPI1_SPRI1, DTCE_RSPI1_SPTI1,
  DTCE_QSPI_SPRI, DTCE_QSPI_SPTI,
  DTCE_SDHI_SBFAI,
  DTCE_MMCIF_MBFAI,
#if defined(BSP_MCU_RX65N_2MB)
  DTCE_RIIC0_RXI0, DTCE_RIIC0_TXI0,
  DTCE_RIIC1_RXI1, DTCE_RIIC1_TXI1,
  DTCE_RIIC2_RXI2, DTCE_RIIC2_TXI2,
#else
  DTCE_RIIC0_RXI0, DTCE_RIIC0_TXI0,
  DTCE_RIIC2_RXI2, DTCE_RIIC2_TXI2,
#endif /* defined(BSP_MCU_RX65N_2MB) */
  DTCE_SCI0_RXI0, DTCE_SCI0_TXI0,
  DTCE_SCI1_RXI1, DTCE_SCI1_TXI1,
  DTCE_SCI2_RXI2, DTCE_SCI2_TXI2,
  DTCE_ICU_IRQ0, DTCE_ICU_IRQ1, DTCE_ICU_IRQ2, DTCE_ICU_IRQ3,
  DTCE_ICU_IRQ4, DTCE_ICU_IRQ5, DTCE_ICU_IRQ6, DTCE_ICU_IRQ7,
  DTCE_ICU_IRQ8, DTCE_ICU_IRQ9, DTCE_ICU_IRQ10, DTCE_ICU_IRQ11,
  DTCE_ICU_IRQ12, DTCE_ICU_IRQ13, DTCE_ICU_IRQ14,
  DTCE_ICU_IRQ15,
  DTCE_SCI3_RXI3, DTCE_SCI3_TXI3,
  DTCE_SCI4_RXI4, DTCE_SCI4_TXI4,
  DTCE_SCI5_RXI5, DTCE_SCI5_TXI5,
  DTCE_SCI6_RXI6, DTCE_SCI6_TXI6,
  DTCE_PDC_PCDFI,
  DTCE_SCI7_RXI7, DTCE_SCI7_TXI7,
  DTCE_SCI8_RXI8, DTCE_SCI8_TXI8,
  DTCE_SCI9_RXI9, DTCE_SCI9_TXI9,
  DTCE_SCI10_RXI10, DTCE_SCI10_TXI10,
  DTCE_RSPI2_SPRI2, DTCE_RSPI2_SPTI2,
  DTCE_SCI11_RXI11, DTCE_SCI11_TXI11,
  DTCE_SCI12_RXI12, DTCE_SCI12_TXI12,
  DTCE_DMAC_DMAC0I, DTCE_DMAC_DMAC1I, DTCE_DMAC_DMAC2I, DTCE_DMAC_DMAC3I,
  DTCE_EXDMAC_EXDMAC0I, DTCE_EXDMAC_EXDMAC1I,
  DTCE_PERIB_INTB128, DTCE_PERIB_INTB129, DTCE_PERIB_INTB130,
  DTCE_PERIB_INTB131, DTCE_PERIB_INTB132,
  DTCE_PERIB_INTB133, DTCE_PERIB_INTB134, DTCE_PERIB_INTB135,
  DTCE_PERIB_INTB136, DTCE_PERIB_INTB137,
  DTCE_PERIB_INTB138, DTCE_PERIB_INTB139, DTCE_PERIB_INTB140,
  DTCE_PERIB_INTB141, DTCE_PERIB_INTB142,
  DTCE_PERIB_INTB143, DTCE_PERIB_INTB144, DTCE_PERIB_INTB145,
  DTCE_PERIB_INTB146, DTCE_PERIB_INTB147,
  DTCE_PERIB_INTB148, DTCE_PERIB_INTB149, DTCE_PERIB_INTB150,
  DTCE_PERIB_INTB151, DTCE_PERIB_INTB152,
  DTCE_PERIB_INTB153, DTCE_PERIB_INTB154, DTCE_PERIB_INTB155,
  DTCE_PERIB_INTB156, DTCE_PERIB_INTB157,
  DTCE_PERIB_INTB158, DTCE_PERIB_INTB159, DTCE_PERIB_INTB160,
  DTCE_PERIB_INTB161, DTCE_PERIB_INTB162,
  DTCE_PERIB_INTB163, DTCE_PERIB_INTB164, DTCE_PERIB_INTB165,
  DTCE_PERIB_INTB166, DTCE_PERIB_INTB167,
  DTCE_PERIB_INTB168, DTCE_PERIB_INTB169, DTCE_PERIB_INTB170,
  DTCE_PERIB_INTB171, DTCE_PERIB_INTB172,
  DTCE_PERIB_INTB173, DTCE_PERIB_INTB174, DTCE_PERIB_INTB175,
  DTCE_PERIB_INTB176, DTCE_PERIB_INTB177,
  DTCE_PERIB_INTB178, DTCE_PERIB_INTB179, DTCE_PERIB_INTB180,
  DTCE_PERIB_INTB181, DTCE_PERIB_INTB182,
  DTCE_PERIB_INTB183, DTCE_PERIB_INTB184, DTCE_PERIB_INTB185,
  DTCE_PERIB_INTB186, DTCE_PERIB_INTB187,
  DTCE_PERIB_INTB188, DTCE_PERIB_INTB189, DTCE_PERIB_INTB190,
  DTCE_PERIB_INTB191, DTCE_PERIB_INTB192,
  DTCE_PERIB_INTB193, DTCE_PERIB_INTB194, DTCE_PERIB_INTB195,
  DTCE_PERIB_INTB196, DTCE_PERIB_INTB197,
  DTCE_PERIB_INTB198, DTCE_PERIB_INTB199, DTCE_PERIB_INTB200,
  DTCE_PERIB_INTB201, DTCE_PERIB_INTB202,
  DTCE_PERIB_INTB203, DTCE_PERIB_INTB204, DTCE_PERIB_INTB205,
  DTCE_PERIB_INTB206, DTCE_PERIB_INTB207,
  DTCE_PERIA_INTA208, DTCE_PERIA_INTA209, DTCE_PERIA_INTA210,
  DTCE_PERIA_INTA211, DTCE_PERIA_INTA212,
  DTCE_PERIA_INTA213, DTCE_PERIA_INTA214, DTCE_PERIA_INTA215,
  DTCE_PERIA_INTA216, DTCE_PERIA_INTA217,
  DTCE_PERIA_INTA218, DTCE_PERIA_INTA219, DTCE_PERIA_INTA220,
  DTCE_PERIA_INTA221, DTCE_PERIA_INTA222,
  DTCE_PERIA_INTA223, DTCE_PERIA_INTA224, DTCE_PERIA_INTA225,
  DTCE_PERIA_INTA226, DTCE_PERIA_INTA227,
  DTCE_PERIA_INTA228, DTCE_PERIA_INTA229, DTCE_PERIA_INTA230,
  DTCE_PERIA_INTA231, DTCE_PERIA_INTA232,
  DTCE_PERIA_INTA233, DTCE_PERIA_INTA234, DTCE_PERIA_INTA235,
  DTCE_PERIA_INTA236, DTCE_PERIA_INTA237,
  DTCE_PERIA_INTA238, DTCE_PERIA_INTA239, DTCE_PERIA_INTA240,
  DTCE_PERIA_INTA241, DTCE_PERIA_INTA242,
  DTCE_PERIA_INTA243, DTCE_PERIA_INTA244, DTCE_PERIA_INTA245,
  DTCE_PERIA_INTA246, DTCE_PERIA_INTA247,
  DTCE_PERIA_INTA248, DTCE_PERIA_INTA249, DTCE_PERIA_INTA250,
  DTCE_PERIA_INTA251, DTCE_PERIA_INTA252,
  DTCE_PERIA_INTA253, DTCE_PERIA_INTA254, DTCE_PERIA_INTA255
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void rx65n_dtc_module_enable(void);
static dtc_err_t rx65n_dtc_set_dynamic_transfer_data
      (dtc_dynamic_transfer_data_cfg_t * p_transfer_cfg,
           dtc_transfer_data_t * p_transfer_data);
static dtc_err_t rx65n_dtc_validate_dynamic_params
     (dtc_dynamic_transfer_data_cfg_t * p_transfer_cfg,
      dtc_transfer_data_t * p_transfer_data);
static dtc_err_t rx65n_dtc_set_static_transfer_data(
                       dtc_static_transfer_data_cfg_t * p_transfer_cfg,
                       dtc_transfer_data_t * p_transfer_data);
static void rx65n_dtc_readskip_enable(DTC_HANDLE handle);
#ifndef CONFIG_RX65N_DTC_TRANSFER_DATA_READ_SKIP
static void rx65n_dtc_readskip_disable(DTC_HANDLE handle);
#endif

/****************************************************************************
 * DMA register access functions
 ****************************************************************************/

