apache/nuttx/arch/renesas/src/rx65n/rx65n_dtc.c
/* Read register from DTC */

static inline uint32_t dtcchan_getreg(struct rx65n_dtc_s *dtc,
                                      uint32_t offset)
{
  return getreg32(dtc->base + offset);
}

/* Write to DTC register */

static inline void dtcchan_putreg(struct rx65n_dtc_s *dtc,
                                  uint32_t offset, uint32_t value)
{
  putreg32(value, dtc->base + offset);
}

/****************************************************************************
 * Function Name: rx65n_dtc_module_enable
 * Description  : Releases module stop state.
 * Arguments    : None
 * Return Value : None
 ****************************************************************************/

static void rx65n_dtc_module_enable(void)
{
  /* Enable writing to MSTP registers. */

  SYSTEM.PRCR.WORD = 0xa50b;
  MPC.PWPR.BIT.B0WI = 0;
  MPC.PWPR.BIT.PFSWE = 1;

  /* Release from module stop state. */

  MSTP(DTC) = 0;
}

/****************************************************************************
 * Function Name: rx65n_dtc_set_dynamic_transfer_data
 * Description  :
 *       Set the dynamic dynamic transfer parameter in transfer data
 *
 * Input Parameters :
 *    p_transfer_cfg - Reguested configuration
 *    p_transfer_data  - Transfer information RAM memory
 *
 * Return :
 *     dtc_err_t -  error codes
 ****************************************************************************/

static dtc_err_t rx65n_dtc_set_dynamic_transfer_data
                (dtc_dynamic_transfer_data_cfg_t * p_transfer_cfg,
                 dtc_transfer_data_t * p_transfer_data)
{
  /* Map transfer data to st_dtc_internal_registers_t */

  volatile st_dtc_internal_registers_t *td_ptr
            = (volatile st_dtc_internal_registers_t *)p_transfer_data;

  /* Get  MRA, CRA and CRB internal register from td_ptr */

#if defined(CONFIG_RX65N_DTC_SHORT_ADDRESS_MODE)/* Short address mode */
  volatile dtc_mra_t  *p_mra = &(td_ptr->FIRST_LWORD.REG.MRA);
  volatile dtc_cra_t *p_cra = &(td_ptr->THIRD_LWORD.REG.CRA);
  volatile dtc_crb_t *p_crb = &(td_ptr->THIRD_LWORD.REG.CRB);

#else /* Full address mode */
  volatile dtc_mra_t  *p_mra = &(td_ptr->FIRST_LWORD.REG.MRA);
  volatile dtc_cra_t *p_cra = &(td_ptr->FOURTH_LWORD.REG.CRA);
  volatile dtc_crb_t * p_crb = &(td_ptr->FOURTH_LWORD.REG.CRB);

#endif

  /* DTC data transfer size */

  if (((p_transfer_cfg->data_size) == DTC_DATA_SIZE_BYTE) ||
        ((p_transfer_cfg->data_size) == DTC_DATA_SIZE_WORD) ||
        ((p_transfer_cfg->data_size) == DTC_DATA_SIZE_LWORD))
    {
      p_mra->BYTE &= (~(3 << 4));
      p_mra->BYTE |= p_transfer_cfg->data_size;
    }
  else
    {
      return DTC_ERR_INVALID_ARG;
    }

  /* Set CRA and CRB internal register */

  switch (p_mra->BIT.MD) /* DTC transfer mode */
    {
      case 0x0: /* Normal mode */
        {
            if (DTC_MAX_16BITS_COUNT_VAL == p_transfer_cfg->transfer_count)/* Transfer count = 65536 */
            {
                p_cra->WORD = 0x0000;
            }
            else /* 1 - 65535 */
            {
                p_cra->WORD = (uint16_t)p_transfer_cfg->transfer_count;
            }
        break;
        }

        case 0x1: /* Repeat mode */
        {
            /* Set counter. */

            if (p_transfer_cfg->transfer_count < DTC_MAX_8BITS_COUNT_VAL) /* count 1-255 */
            {
                p_cra->BYTE.CRA_H = (uint8_t)p_transfer_cfg->transfer_count;
                p_cra->BYTE.CRA_L = (uint8_t)p_transfer_cfg->transfer_count;
            }
            else if (DTC_MAX_8BITS_COUNT_VAL
                     == p_transfer_cfg->transfer_count)
            {
                p_cra->BYTE.CRA_H = 0x00;
                p_cra->BYTE.CRA_L = 0x00;
            }
            else /* Transfer count > 256 */
            {
                return DTC_ERR_INVALID_ARG;
            }
        break;
        }

        case 0x2: /* DTC_TRANSFER_MODE_BLOCK - Block transfer mode */
        {
            /* Set counter. */

            if (DTC_MAX_16BITS_COUNT_VAL == p_transfer_cfg->transfer_count) /* Transfer count = 65536 */
            {
                p_crb->WORD = 0x0000;
            }
            else /* 1 - 65535 */
            {
                p_crb->WORD = (uint16_t)p_transfer_cfg->transfer_count;
            }

            if (p_transfer_cfg->block_size < DTC_MAX_8BITS_COUNT_VAL) /* Block size 1-255 */
            {
                p_cra->BYTE.CRA_H = (uint8_t)p_transfer_cfg->block_size;
                p_cra->BYTE.CRA_L = (uint8_t)p_transfer_cfg->block_size;
            }
            else if (DTC_MAX_8BITS_COUNT_VAL == p_transfer_cfg->block_size) /* Block size = 256 */
            {
                p_cra->BYTE.CRA_H = 0;
                p_cra->BYTE.CRA_L = 0;
            }
            else /* Invalid block size */
            {
                return DTC_ERR_INVALID_ARG;
            }
        break;
        }

        default:
        {
            return DTC_ERR_INVALID_ARG;
        break;
        }
    }

  /* Set Source and destination address in transfer memory area */

#if defined(CONFIG_RX65N_DTC_SHORT_ADDRESS_MODE)

  /* 3 byte SAR */

  td_ptr->FIRST_LWORD.LWORD &= ~(0x00ffffff);
  td_ptr->FIRST_LWORD.LWORD |= (p_transfer_cfg->source_addr & 0x00ffffff);

  /* 3 byte DAR */

  td_ptr->SECOND_LWORD.LWORD &= ~(0x00ffffff);
  td_ptr->SECOND_LWORD.LWORD   |= (p_transfer_cfg->dest_addr & 0x00ffffff);

#else /* Full address mode */

  /* settings for second long word: SAR */

  td_ptr->SECOND_LWORD.SAR = p_transfer_cfg->source_addr; /* 4 byte SAR */

  /* settings for third long word: DAR */

  td_ptr->THIRD_LWORD.DAR = p_transfer_cfg->dest_addr; /* 4 byte DAR */

#endif
  return DTC_SUCCESS;
}

/****************************************************************************
 * Function Name: rx65n_dtc_validate_dynamic_params
 * Description  :
 *       Validate the dynamic parameter
 *
 * Input Parameters :
 *    p_transfer_cfg - Reguested configuration
 *    p_transfer_data  - Transfer information RAM memory
 *
 * Return :
 *     dtc_err_t -  error codes
 *
 ****************************************************************************/

static dtc_err_t rx65n_dtc_validate_dynamic_params
           (dtc_dynamic_transfer_data_cfg_t * p_transfer_cfg,
            dtc_transfer_data_t * p_transfer_data)
{
  if ((NULL == p_transfer_cfg) || (NULL == p_transfer_data))
    {
      return DTC_ERR_NULL_PTR;
    }

  /* Validate transfer count */

