apache/nuttx/arch/renesas/src/rx65n/rx65n_dtc.c
  if ((p_transfer_cfg->transfer_count < DTC_MIN_COUNT_VAL) ||
        (p_transfer_cfg->transfer_count > DTC_MAX_16BITS_COUNT_VAL))
    {
      return DTC_ERR_INVALID_ARG;
    }

#if defined (CONFIG_RX65N_DTC_SHORT_ADDRESS_MODE) /* Short-address mode */
/* Address must be in: 0x00000000h to 0x007FFFFF and
 * 0xFF800000 to 0xFFFFFFFF
 */

  if ((p_transfer_cfg->source_addr > 0x007fffff)
            && (p_transfer_cfg->source_addr < 0xff800000))
    {
      return DTC_ERR_INVALID_ARG;
    }

  if ((p_transfer_cfg->dest_addr > 0x007fffff)
            && (p_transfer_cfg->dest_addr < 0xff800000))
    {
      return DTC_ERR_INVALID_ARG;
    }

  if (((uint32_t)p_transfer_data > 0x007fffff)
            && ((uint32_t)p_transfer_data < 0xff800000))
    {
      return DTC_ERR_INVALID_ARG;
    }

#endif
  return DTC_SUCCESS;
}

/****************************************************************************
 * Function Name: rx65n_dtc_set_transfer_data
 * Description  :
 *       Set transfer data
 *
 * Input Parameters :
 *    p_transfer_cfg - Reguested configuration
 *    p_transfer_data  - Transfer information RAM memory
 *
 * Return :
 *     dtc_err_t -  error codes
 *
 ****************************************************************************/

static dtc_err_t rx65n_dtc_set_static_transfer_data(
                        dtc_static_transfer_data_cfg_t * p_transfer_cfg,
                          dtc_transfer_data_t * p_transfer_data)
{
  dtc_mra_t  t_mra;
  dtc_mrb_t  t_mrb;
  dtc_cra_t  t_cra;
  dtc_crb_t  t_crb;

  /* Initialize crb. When normal transfer mode or repeat transfer mode is
   * selected, this register is not used and the set value is ignored.
   */

  t_crb.WORD = 0x0000;

  /* Map transfer data to st_dtc_internal_registers_t */

  volatile st_dtc_internal_registers_t *td_ptr =
       (volatile st_dtc_internal_registers_t *)p_transfer_data;

  /* Prepare  MRA and MRB internal register */

#if (DTC_IP_VER >= DTC_IP_VER_DTCb)
#ifndef CONFIG_RX65N_DTC_SHORT_ADDRESS_MODE /* Full-address mode */
  dtc_mrc_t  t_mrc;
  t_mrc.BYTE = (uint8_t)(p_transfer_cfg->disp_add_enable);
#else
  t_mra.BYTE = (uint8_t)(p_transfer_cfg->writeback_disable
                           | p_transfer_cfg->src_addr_mode
                           | p_transfer_cfg->data_size
                           | p_transfer_cfg->transfer_mode);
  t_mrb.BYTE = (uint8_t)(p_transfer_cfg->sequence_end
                           | p_transfer_cfg->refer_index_table_enable
                           | p_transfer_cfg->dest_addr_mode
                           | p_transfer_cfg->repeat_block_side
                           | p_transfer_cfg->response_interrupt
                           | p_transfer_cfg->chain_transfer_enable
                           | p_transfer_cfg->chain_transfer_mode);
#endif
  t_mra.BYTE = (uint8_t)(p_transfer_cfg->src_addr_mode
                                      | p_transfer_cfg->data_size
                                      | p_transfer_cfg->transfer_mode);

     t_mrb.BYTE = (uint8_t)(p_transfer_cfg->dest_addr_mode
                         | p_transfer_cfg->repeat_block_side
                         | p_transfer_cfg->response_interrupt
                          | p_transfer_cfg->chain_transfer_enable
                          | p_transfer_cfg->chain_transfer_mode);
   #endif

  /* Prepare CRA and CRB internal register */

  switch (t_mra.BIT.MD) /* DTC transfer mode */
    {
      case 0x0: /* Normal mode */
        {
          if (DTC_MAX_16BITS_COUNT_VAL == p_transfer_cfg->transfer_count)/* Transfer count = 65536 */
            {
              t_cra.WORD = 0x0000;
            }
            else /* 1 - 65535 */
            {
              t_cra.WORD = (uint16_t)p_transfer_cfg->transfer_count;
            }
          break;
        }

      case 0x1: /* Repeat mode */
        {
          /* Set counter. */

          if (p_transfer_cfg->transfer_count < DTC_MAX_8BITS_COUNT_VAL) /* count 1-255 */
            {
              t_cra.BYTE.CRA_H = (uint8_t)p_transfer_cfg->transfer_count;
              t_cra.BYTE.CRA_L = (uint8_t)p_transfer_cfg->transfer_count;
            }
          else if (DTC_MAX_8BITS_COUNT_VAL == p_transfer_cfg->transfer_count)
            {
              t_cra.BYTE.CRA_H = 0x00;
              t_cra.BYTE.CRA_L = 0x00;
            }
          else /* Transfer count > 256 */
            {
              return DTC_ERR_INVALID_ARG;
            }
          break;
        }

      case 0x2: /* DTC_TRANSFER_MODE_BLOCK - Block transfer mode */
        {
          /* Set counter. */

          if (DTC_MAX_16BITS_COUNT_VAL == p_transfer_cfg->transfer_count)/* Transfer count = 65536 */
            {
              t_crb.WORD = 0x0000;
            }
          else /* 1 - 65535 */
            {
              t_crb.WORD = (uint16_t)p_transfer_cfg->transfer_count;
            }

          if (p_transfer_cfg->block_size < DTC_MAX_8BITS_COUNT_VAL) /* Block size 1-255 */
            {
              t_cra.BYTE.CRA_H = (uint8_t)p_transfer_cfg->block_size;
              t_cra.BYTE.CRA_L = (uint8_t)p_transfer_cfg->block_size;
            }
          else if (DTC_MAX_8BITS_COUNT_VAL == p_transfer_cfg->block_size) /* Block size = 256 */
            {
              t_cra.BYTE.CRA_H = 0;
              t_cra.BYTE.CRA_L = 0;
            }
          else /* Invalid block size */
            {
              return DTC_ERR_INVALID_ARG;
            }
          break;
        }

      default:
        {
          return DTC_ERR_INVALID_ARG;
          break;
        }
    }

  /* Set transfer information in RAM area */
#if defined(CONFIG_RX65N_DTC_SHORT_ADDRESS_MODE)
  /* settings for fist long word: MRA & SAR */

  td_ptr->FIRST_LWORD.LWORD   =  0;     /* clear */
  td_ptr->FIRST_LWORD.REG.MRA =  t_mra; /* 1 byte MRA */
  td_ptr->FIRST_LWORD.LWORD |= (p_transfer_cfg->source_addr & 0x00ffffff);

  /* settings for second long word: MRB & DAR */

  td_ptr->SECOND_LWORD.LWORD   =  0;     /* clear */
  td_ptr->SECOND_LWORD.REG.MRB =  t_mrb; /* 1 byte MRB */
  td_ptr->SECOND_LWORD.LWORD   |= (p_transfer_cfg->dest_addr & 0x00ffffff);

