apache/nuttx/arch/renesas/src/rx65n/rx65n_dtc.c
  /* settings for third long word: CRA & CRB */

  td_ptr->THIRD_LWORD.REG.CRA.WORD = t_cra.WORD;

  td_ptr->THIRD_LWORD.REG.CRB.WORD = t_crb.WORD;

#else /* Full address mode */
  /* settings for fist long word: MRA & MRB */

  td_ptr->FIRST_LWORD.REG.MRA.BYTE = t_mra.BYTE; /* 1 byte MRA */
  td_ptr->FIRST_LWORD.REG.MRB.BYTE = t_mrb.BYTE; /* 1 byte MRB */
#if (DTC_IP_VER_DTCb <= DTC_IP_VER)
  td_ptr->FIRST_LWORD.REG.MRC.BYTE = t_mrc.BYTE; /* 1 byte MRC */
#endif /* (DTC_IP_VER_DTCb <= DTC_IP) */

  /* settings for second long word: SAR */

  td_ptr->SECOND_LWORD.SAR = p_transfer_cfg->source_addr; /* 4 byte SAR */

  /* settings for third long word: DAR */

  td_ptr->THIRD_LWORD.DAR = p_transfer_cfg->dest_addr; /* 4 byte DAR */

  /* settings for fourth long word: CRA & CRB */

  td_ptr->FOURTH_LWORD.REG.CRA.WORD = t_cra.WORD;

  td_ptr->FOURTH_LWORD.REG.CRB.WORD = t_crb.WORD;

#endif
  return DTC_SUCCESS;
}

/****************************************************************************
 * Name: rx65n_dtc_readskip_enable
 *
 * Description:
 *   DTC Transfer Information Read Skip enable
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *
 * Assumptions:
 *   - DTC handle allocated by rx65n_dtc_gethandle()
 *
 ****************************************************************************/

static void rx65n_dtc_readskip_enable(DTC_HANDLE handle)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;
  uint8_t regval8;

  /* Configure Read skip bit in DTCCR register */

  regval8 = dtcchan_getreg(dtchandle, DTC_DTCCR_OFFSET);
  regval8 |= (DTC_DTCCR_RRS);
  dtcchan_putreg(dtchandle, DTC_DTCCR_OFFSET, regval8);
}

/****************************************************************************
 * Name: rx65n_dtc_readskip_disable
 *
 * Description:
 *   DTC Transfer Information Read Skip disable
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *
 * Assumptions:
 *   - DTC handle allocated by rx65n_dtc_gethandle()
 *
 ****************************************************************************/
#ifndef CONFIG_RX65N_DTC_TRANSFER_DATA_READ_SKIP
static void rx65n_dtc_readskip_disable(DTC_HANDLE handle)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;
  uint8_t regval8;

  /* Configure Read skip bit in DTCCR register */

  regval8 = dtcchan_getreg(dtchandle, DTC_DTCCR_OFFSET);
  regval8 &= ~(DTC_DTCCR_RRS);
  dtcchan_putreg(dtchandle, DTC_DTCCR_OFFSET, regval8);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rx65n_dtc_start
 *
 * Description:
 *   DTC Module Start
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *
 * Assumptions:
 *   - DTC handle allocated by rx65n_dtc_gethandle()
 *
 ****************************************************************************/

void rx65n_dtc_start(DTC_HANDLE handle)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;
  uint8_t regval8;

  /* Configure Read skip bit in DTCST register */

  regval8 = dtcchan_getreg(dtchandle, DTC_DTCST_OFFSET);
  regval8 |= (DTC_DTCST_DTCST);
  dtcchan_putreg(dtchandle, DTC_DTCST_OFFSET, regval8);
}

/****************************************************************************
 * Name: rx65n_dtc_stop
 *
 * Description:
 *   DTC Module Stop
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *
 * Assumptions:
 *   - DTC handle allocated by rx65n_dtc_gethandle()
 *
 ****************************************************************************/

void rx65n_dtc_stop(DTC_HANDLE handle)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;
  uint8_t regval8;

  /* Configure Read skip bit in DTCST register */

  regval8 = dtcchan_getreg(dtchandle, DTC_DTCST_OFFSET);
  regval8 &= ~(DTC_DTCST_DTCST);
  dtcchan_putreg(dtchandle, DTC_DTCST_OFFSET, regval8);
}

/****************************************************************************
 * Name: rx65n_dtc_status
 *
 * Description:
 *   Output the status of DTC
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *
 * Output Parameters:
 *    p_stat - DTC status structure
 *
 * Assumptions:
 *   - DTC handle allocated by rx65n_get_dtchandle()
 *
 ****************************************************************************/

void rx65n_dtc_status(DTC_HANDLE handle, dtc_stat_t *p_stat)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;

  DEBUGASSERT(dtchandle != NULL || p_stat |= NULL);

  if (dtchandle->initialized)
    {
      /* Check DTC Status */

      if (0 == (DTC.DTCSTS.WORD & DTC_ACT_BIT_MASK)) /* DTC transfer operation is not in progress. */
        {
          p_stat->in_progress = false;

          /* DTC is not in progress. -> vector number is invalid. */
        }
      else /* DTC transfer operation is in progress. */
        {
          p_stat->in_progress = true;

      /* Get the current vector number. */

          p_stat->vect_nr = (uint8_t)(DTC.DTCSTS.WORD & DTC_VECT_NR_MASK);
        }
    }
}

#if defined(CONFIG_RX65N_DTC_SEQUENCE_TRANSFER_MODE)
/****************************************************************************
 * Name: rx65n_dtc_seq_enable
 *
 * Description:
 *   DTC Module sequence transfer enable and set respective vector number
 *   for sequence transfer
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *    src -Activation source nothing but vector number
 *
 * Assumptions:
 *   - DTC handle allocated by rx65n_dtc_gethandle()
 *
 ****************************************************************************/

void rx65n_dtc_seq_enable(DTC_HANDLE handle, uint8_t src)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;

  DEBUGASSERT(handle != NULL);

  dtc_activation_source_t act_source = (dtc_activation_source_t)src;

  /* Configure vector number for sequence transfer */

  DTC.DTCSQE.WORD = (DTC_ESPSEL_BIT_MASK | (uint16_t)act_source);
}

/****************************************************************************
 * Name: rx65n_dtc_seq_disable
 *
 * Description:
 *   DTC Module sequence transfer enable and clear vector number for
 *   sequence transfer in DTCSQE
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *
 * Assumptions:
 *   - DTC handle allocated by rx65n_dtc_gethandle()
 *
 ****************************************************************************/

void rx65n_dtc_seq_disable(DTC_HANDLE handle)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;

