apache/nuttx/arch/renesas/src/rx65n/rx65n_dtc.c
  if (0 == count)
    {
      /* Set the cpu interrupt to the sequence number. */

      *ptr = DTC_INVALID_CMND;
    }
  else
    {
      /* Set transfer Information as per request */

      for (i = 0; i < count ; i++)
        {
          if (rx65n_dtc_set_static_transfer_data(p_stransfer_cfg,
                      p_transfer_data) != DTC_SUCCESS)
            {
              return DTC_ERR_INVALID_ARG;
            }

          p_stransfer_cfg++;
          p_transfer_data++;
          count--;
        }
    }

  return DTC_SUCCESS;
}
#endif

/****************************************************************************
 * Name: rx65n_dtc_setup_dynamic_transferdata
 *
 * Description:
 *   Setup dynamic transfer info like src and destination address and number
 *   of data to transfer
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *    src -Activation source
 *    dcfg -Dynamic config parameter
 *    nchain - Number of chain transfer
 *
 * Returned Value:
 *  dtc_err_t -DTC API error codes
 ****************************************************************************/

dtc_err_t rx65n_dtc_setup_dynamic_transferdata(DTC_HANDLE handle,
                                                uint8_t src,
                                      uint32_t dcfg, uint32_t nchain)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;
  dtc_err_t ret = DTC_SUCCESS;
  uint32_t *ptr         = NULL;
  dtc_transfer_data_t *p_transfer_data = NULL;
  uint8_t   rrs_backup  = 0;
  uint8_t   dtce_backup = 0;
  irqstate_t flags;
  int i;

  /* Chain transfer count */

  uint32_t count = nchain + 1;

  /* Dynamic user configuration */

  dtc_dynamic_transfer_data_cfg_t *p_dtransfer_cfg =
                           (dtc_dynamic_transfer_data_cfg_t *)dcfg;

  /* Activation source */

  dtc_activation_source_t act_source = (dtc_activation_source_t)src;

  flags = enter_critical_section();

  /* Store old value of DTCERn.DTCE bit. */

  dtce_backup = ICU.DTCER[act_source].BIT.DTCE;

  /* Disable the interrupt source. Clear the DTCER */

  ICU.DTCER[act_source].BIT.DTCE = 0;

  /* Store RRS and clear RRS */

  rrs_backup =  DTC.DTCCR.BIT.RRS;
  DTC.DTCCR.BIT.RRS = 0;

  /* Get Transfer data pointer */

  ptr = (uint32_t *)(dtchandle->vectortable + (4 * act_source));
  p_transfer_data  = (dtc_transfer_data_t *) (*ptr);

  ret = rx65n_dtc_validate_dynamic_params(p_dtransfer_cfg, p_transfer_data);
  if (DTC_SUCCESS != ret)
    {
      leave_critical_section(flags);
      return ret;
    }

  /* Update transfer data with address and counter */

  for (i = 0; i < count; i++)
    {
      if (rx65n_dtc_set_dynamic_transfer_data(p_dtransfer_cfg,
                                  p_transfer_data) != DTC_SUCCESS)
        {
          leave_critical_section(flags);
          return DTC_ERR_INVALID_ARG;
        }

      p_dtransfer_cfg++;
      p_transfer_data++;
      count--;
    }

  /* Restore RRS bit */

  DTC.DTCCR.BIT.RRS = rrs_backup;

  /* Restore the DTCE bit. */

  ICU.DTCER[act_source].BIT.DTCE = dtce_backup;

  leave_critical_section(flags);

  return ret;
}

/****************************************************************************
 * Name: rx65n_dtc_setup_static_transferdata
 *
 * Description:
 *   Configure and Creates the transfer data for a activation source.
 *
 * Input Parameters:
 *    handle - DTC_HANDLE
 *    src -Activation source
 *    scfg -Pointer to contains the settings for Transfer data
 *    pdt - pointer to data transfer
 *    nchain - Number of chain transfer
 *
 * Returned Value:
 *  dtc_err_t -DTC API error codes
 *
 ****************************************************************************/

dtc_err_t rx65n_dtc_setup_static_transferdata(DTC_HANDLE handle, uint8_t src,
                               uint32_t scfg, uint32_t pdt, uint32_t nchain)
{
  struct rx65n_dtc_s *dtchandle = (struct rx65n_dtc_s *)handle;

  uint32_t *ptr = NULL;

  int i;

  /* Transfer Information count */

  uint32_t count = nchain + 1;

  /* Activation source */

  dtc_activation_source_t act_source = (dtc_activation_source_t)src;

  /* Static User Configuration */

  dtc_static_transfer_data_cfg_t *p_stransfer_cfg =
                          (dtc_static_transfer_data_cfg_t *)scfg;

  /* Allocate  memory in RAM for transfer information */

  dtc_transfer_data_t *p_transfer_data = (dtc_transfer_data_t *)pdt;

  if ((act_source < DTC_MIN_VECT_NUMBER) ||
      (act_source > DTC_MAX_VECT_NUMBER))
    {
      return DTC_ERR_INVALID_ARG;
    }

  if (p_stransfer_cfg == NULL)
    {
      return DTC_ERR_INVALID_ARG;
    }

  if (p_transfer_data == NULL)
    {
      return DTC_ERR_INVALID_ARG;
    }

  /* Set Transfer information pointer in vector table */

  ptr = (uint32_t *)(dtchandle->vectortable + (4 * act_source));
  *ptr = (uint32_t)p_transfer_data;

#if (DTC_IP_VER_DTCb <= DTC_IP_VER)
  /* Set the 0 value */

  p_stransfer_cfg->writeback_disable = DTC_WRITEBACK_ENABLE;
  p_stransfer_cfg->sequence_end = DTC_SEQUENCE_TRANSFER_CONTINUE;
  p_stransfer_cfg->refer_index_table_enable = DTC_REFER_INDEX_TABLE_DISABLE;
  p_stransfer_cfg->disp_add_enable = DTC_SRC_ADDR_DISP_ADD_DISABLE;
#endif

  /* Set transfer Information as per request */

  for (i = 0; i < count ; i++)
    {
      if (rx65n_dtc_set_static_transfer_data(p_stransfer_cfg,
                      p_transfer_data) != DTC_SUCCESS)
        {
          return DTC_ERR_INVALID_ARG;
        }

      p_stransfer_cfg++;
      p_transfer_data++;
      count--;
    }

  return DTC_SUCCESS;
}

/****************************************************************************
 * Name: rx65n_dtc_gethandle
 *
 * Description:
 *   Get DTC handle.
 *
 * Input Parameters:
 *   chan - Identifies the channel resource. For the RX65N, this
 *     is simply the channel number is 0
 *
 * Returned Value:
 *   dtchandle-Provided that 'chan' is valid, this function ALWAYS returns a
 *   non-NULL,void* DTC channel handle.  (If 'chndx' is invalid, the
 *   function will assert if debug is enabled or do something ignorant
 *    otherwise).
 *
 ****************************************************************************/

DTC_HANDLE rx65n_dtc_gethandle(unsigned int chan)
{
  struct rx65n_dtc_s *dtchandle = NULL;

