apache/nuttx/arch/renesas/src/rx65n/rx65n_dtc.c
  dtchandle = &g_dtchandle[chan];

  DEBUGASSERT(chan < DTC_NCHANNELS);

  return (DTC_HANDLE)dtchandle;
}

/****************************************************************************
 * Name: rx65n_dtc_initialize
 *
 * Description:
 *   Initialize the DTC
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void rx65n_dtc_initialize(void)
{
  struct rx65n_dtc_s *dtchandle = NULL;

  int chndx;
  uint8_t *dtctable;
  volatile uint32_t dtce_cnt = 0;

  /* Initialize each DTC channel */

  for (chndx = 0; chndx < DTC_NCHANNELS; chndx++) /* RX65N support only one channel */
    {
      dtchandle = &g_dtchandle[chndx];

      /* Get DTC Vector table */

      dtctable = dtchandle->vectortable;

      /* Clear all DTCER registers of all activation sources */

      for (dtce_cnt = 0 ; dtce_cnt < DTC_NUM_INTERRUPT_SRC; dtce_cnt++)
        {
          ICU.DTCER[g_dtcsource[dtce_cnt]].BIT.DTCE = 0;
        }

      /* Cancel module stop for DMAC and DTC */

      rx65n_dtc_module_enable();

      /* Configure DTC Vector Table Base Register */

      dtchandle->vectortable = (uint8_t *)((uint32_t)(dtctable
                                                + DTC_VECTOR_ADDRESS_ALIGN)
                              & DTC_VECTOR_ADDRESS_MASK);
      dtcchan_putreg(dtchandle, DTC_DTCVBR_OFFSET,
                            (uint32_t)dtchandle->vectortable);

#if defined(CONFIG_RX65N_DTC_SEQUENCE_TRANSFER_MODE)
      /* Configure DTC Index Table Base Register for sequence transfer */

      dtchandle->indextable = (uint8_t *)(dtchandle->vectortable
                                            + DTC_VECTOR_TABLE_SIZE);
      dtcchan_putreg(dtchandle, DTC_DTCIBR_OFFSET,
                        (uint32_t)dtchandle->indextable);
#endif

      /* Stop DTC */

      rx65n_dtc_stop(dtchandle);

#if defined(CONFIG_RX65N_DTC_SEQUENCE_TRANSFER_MODE)

      /* In sequence transfer mode, set full address mode */

      DTC.DTCADMOD.BIT.SHORT = 0;
      dtchandle->addmode = 0;

      /* Enable sequence transfer */

      DTC.DTCSQE.BIT.ESPSEL = 1;

      /* Clear vector number for sequence transfer */

      DTC.DTCSQE.WORD &= (~DTC_ESPSEL_BIT_MASK);

      /* Configure displacement */

      DTC.DTCDISP = CONFIG_RX65N_DTC_DISPLACEMENT;

#else

      /* Configure address space: short or full address mode */

#if defined(CONFIG_RX65N_DTC_SHORT_ADDRESS_MODE) /* Short-address mode */
      DTC.DTCADMOD.BIT.SHORT = 1;
      dtchandle->addmode = 1;
#else
      /* Full-address mode */

      DTC.DTCADMOD.BIT.SHORT = 0;
      dtchandle->addmode = 0;

      /* Configure displacement */

      DTC.DTCDISP = CONFIG_RX65N_DTC_DISPLACEMENT;
#endif

#endif

      /* Configure read skip enable/disable */
#if defined(CONFIG_RX65N_DTC_TRANSFER_DATA_READ_SKIP) /* Read-Skip Enable*/
      rx65n_dtc_readskip_enable(dtchandle);
#else /* Read-Skip disable*/
      rx65n_dtc_readskip_disable(dtchandle);

#endif

      /* Update initializing status */

      dtchandle->initialized =  TRUE;

      /* Start DTC */

      rx65n_dtc_start(dtchandle);
    }
}
#endif /* End of CONFIG_RX65N_DTC*/
